# EDA - Statsbidrag och Schablonnivåer

In [ ]:
import pandas as pd

df_list = pd.read_html("https://www.myh.se/yrkeshogskolan/ansok-om-att-bedriva-utbildning/ansokan-kurser/statsbidrag-och-schablonnivaer", encoding="utf-8")
len(df_list), type(df_list)

(1, list)

In [13]:
df_list[0]

,Utbildningsområde,Utan momskompensation,Med momskompensation
0,Data/IT,69 900,74 100
1,"Ekonomi, administration och försäljning",62 900,66 600
2,Friskvård och kroppsvård,74 800,79 200
3,"Hotell, restaurang och turism",64 900,68 700
4,Hälso- och sjukvård samt socialt arbete,67 000,71 000
5,Journalistik och information,66 600,70 600
6,Juridik,60 500,64 100
7,"Kultur, media och design",84 400,89 400
8,"Lantbruk, djurvård, trädgård, skog och fiske",110 200,116 700
9,Pedagogik och undervisning,71 300,75 500
10,Samhällsbyggnad och byggteknik,70 400,74 600
11,Säkerhetstjänster,63 000,66 800
12,Teknik och tillverkning,85 900,91 000
13,Transporttjänster,80 400,85 200

In [3]:
df_list[0].head()

,Utbildningsområde,Utan momskompensation,Med momskompensation
0,Data/IT,69 900,74 100
1,"Ekonomi, administration och försäljning",62 900,66 600
2,Friskvård och kroppsvård,74 800,79 200
3,"Hotell, restaurang och turism",64 900,68 700
4,Hälso- och sjukvård samt socialt arbete,67 000,71 000

In [4]:
df_list[0].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Utbildningsområde      14 non-null     object
 1   Utan momskompensation  14 non-null     object
 2   Med momskompensation   14 non-null     object
dtypes: object(3)
memory usage: 468.0+ bytes

In [5]:
df_list[0].dtypes

Utbildningsområde        object
Utan momskompensation    object
Med momskompensation     object
dtype: object

In [6]:
df_list[0]['Utan momskompensation'].max()

'85 900'

In [7]:
df_list[0]['Med momskompensation']

0      74 100
1      66 600
2      79 200
3      68 700
4      71 000
5      70 600
6      64 100
7      89 400
8     116 700
9      75 500
10     74 600
11     66 800
12     91 000
13     85 200
Name: Med momskompensation, dtype: object

In [8]:
df_list[0].columns

Index(['Utbildningsområde', 'Utan momskompensation', 'Med momskompensation'], dtype='object')

In [ ]:
data_it_utan = df_list[0][df_list[0]['Utbildningsområde'] == 'Data/IT'][['Utan momskompensation']].round()
data_it_utan

  Utan momskompensation
0                69 900

In [15]:
data_it_moms = df_list[0][df_list[0]['Utbildningsområde'] == 'Data/IT'][['Med momskompensation']].round()
data_it_moms

  Med momskompensation
0               74 100